'''Алгоритм вычисления функции F (n) задан следующими соотношениями:
F(n) = n*2 при n <= 10
F(n) = F(n - 3) - F(n - 9) • 2, если n чётно и n > 10
F(n) = F(n - 2) • 2 - F(n - 7), если n нечётно и n> 10
Определите сумму цифр результата для F (3063).'''


s = [0]*3064

for n in range(0, 3064):
    if n <= 10:
        s[n] = n*2
    elif n%2 == 0:
        s[n] = s[n-3] - s[n-9] * 2
    else:
        s[n] = s[n-2]*2 - s[n-7]

print(sum(list(s[3063])))

